In [4]:
import pandas as pd

# Series

In [6]:
obj = pd.Series([1,2,4,-6,0,-3,8])
obj

0    1
1    2
2    4
3   -6
4    0
5   -3
6    8
dtype: int64

In [15]:
obj.values

array([ 1,  2,  4, -6,  0, -3,  8])

In [16]:
obj.index

RangeIndex(start=0, stop=7, step=1)

In [17]:
obj_1 = pd.Series??

In [18]:
obj_1 = pd.Series( data = ["Waqar","Yawar","Ali","Ahmed"], index = ["W","Y","A","Ah"])

In [19]:
obj_1

W     Waqar
Y     Yawar
A       Ali
Ah    Ahmed
dtype: object

In [28]:
print(obj_1['W'])
print(obj_1['Ah'])
print(obj_1['Y'])

Waqar
Ahmed
Yawar

In [29]:
obj_1[['Y','A','W']]

Y    Yawar
A      Ali
W    Waqar
dtype: object

In [30]:
obj_2 = pd.Series(data = [1,-2,7,-1,0,4,-3,6,7,-1,5,8])
obj_2[obj_2 > 0]

0     1
2     7
5     4
7     6
8     7
10    5
11    8
dtype: int64

In [31]:
obj_2 * 2

0      2
1     -4
2     14
3     -2
4      0
5      8
6     -6
7     12
8     14
9     -2
10    10
11    16
dtype: int64

In [39]:
obj_3 = pd.Series(data =, index = ['first','second','third'])

In [42]:
print('second' in obj_3)
print('third' in obj_3)

True

You can create a series using python dictionary

In [49]:
names = { 'w':'waqar',
          'y':'yawar',
          'a': 'ali',}

In [44]:
obj_names = pd.Series(names)

In [45]:
obj_names

w    waqar
y    yawar
a      ali
dtype: object

In [52]:
obj_4 = pd.Series(data = [150000,200000,300000,800000], index = ['Balochistan','Giglit','Punjab','Sindh'])
obj_4

Balochistan    150000
Giglit         200000
Punjab         300000
Sindh          800000
dtype: int64

In [57]:
obj_4.name = 'province_population'
obj_4.index.name = "Provinces"
obj_4

Provinces
Balochistan    150000
Giglit         200000
Punjab         300000
Sindh          800000
Name: province_population, dtype: int64

# Data Frame

In [67]:
data = { 'names' : ['waqar','ali','ahmed','yawar','malik','haider'],
         'salaries' : [15000,20000,30000,40000,60000,70000],
         'tax':['n/a','n/a','given','given','n/a','given'],
    }

In [68]:
frame = pd.DataFrame(data)
frame

    names  salaries    tax
0   waqar     15000    n/a
1     ali     20000    n/a
2   ahmed     30000  given
3   yawar     40000  given
4   malik     60000    n/a
5  haider     70000  given

For large DataFrames, the head method selects only the first five rows

In [70]:
frame.head()

   names  salaries    tax
0  waqar     15000    n/a
1    ali     20000    n/a
2  ahmed     30000  given
3  yawar     40000  given
4  malik     60000    n/a

If you specify a sequence of columns, the DataFrame’s columns will be arranged in
that order

In [74]:
pd.DataFrame(data, index = [4,3,1,2,0,5])

    names  salaries    tax
4   waqar     15000    n/a
3     ali     20000    n/a
1   ahmed     30000  given
2   yawar     40000  given
0   malik     60000    n/a
5  haider     70000  given

In [76]:
pd.DataFrame(data, columns = ['names','tax','salaries'])

    names    tax  salaries
0   waqar    n/a     15000
1     ali    n/a     20000
2   ahmed  given     30000
3   yawar  given     40000
4   malik    n/a     60000
5  haider  given     70000

If you pass a column that isn’t contained in the dict, it will appear with missing values
in the result

In [89]:
frame_2 = pd.DataFrame(data, columns = ['names','salaries','tax','debt'])

A column in a DataFrame can be retrieved as a Series either by dict-like notation or
by attribute

In [81]:
print(frame['salaries'])
print(frame.names)

0    15000
1    20000
2    30000
3    40000
4    60000
5    70000
Name: salaries, dtype: int64
0     waqar
1       ali
2     ahmed
3     yawar
4     malik
5    haider
Name: names, dtype: object

Rows can also be retrieved by position or name with the special loc attribute

In [88]:
frame.loc[4]

names       malik
salaries    60000
tax           n/a
Name: 4, dtype: object

In [91]:
frame_2.debt = 15000
frame_2

    names  salaries    tax   debt
0   waqar     15000    n/a  15000
1     ali     20000    n/a  15000
2   ahmed     30000  given  15000
3   yawar     40000  given  15000
4   malik     60000    n/a  15000
5  haider     70000  given  15000

When you are assigning lists or arrays to a column, the value’s length must match the
length of the DataFrame. If you assign a Series, its labels will be realigned exactly to
the DataFrame’s index, inserting missing values in any holes

In [92]:
values_for_debt = pd.Series(data = [1200,100,2000,3560,4000,2500], index = [3,2,1,4,5,0])

In [93]:
frame_2.debt = values_for_debt

In [94]:
frame_2

    names  salaries    tax  debt
0   waqar     15000    n/a  2500
1     ali     20000    n/a  2000
2   ahmed     30000  given   100
3   yawar     40000  given  1200
4   malik     60000    n/a  3560
5  haider     70000  given  4000